<script setup>

</script>

<template>
  <div class="container">
    <div class="favorite-hobby_block__wrapper wrapper">
      <div class="block__title">
        Почему программирование стало для меня любимым занятием
      </div>
      <div class="block__content">
        Если честно, то я не могу дать однозначного ответа на данный вопрос. Но попробую описать несколько мыслей,
        которые пришли ко мне первыми:
        <ul>
          <li>
            Первая причина - перешагивание (в хорошем смысле) самого себя
          </li>
          И на работе и в период моего обучения почти каждая задача (за исключение чего-то совсем тривиального), в
          которой
          требовалось что-то, что я еще "не трогал", по началу казалась чем-то непостижимым. Но по мере работы
          появлялось чувство осознанности и усваивания новой информации. А после победы над ней появляется так же
          чувство небольшой победы и над собой.
          <li>
            Вторая причина - сам процесс
          </li>
          С детства я так или иначе взаимодействовал с ПК и разной электроникой. Именно в ПК меня, тогда еще юного, меня
          заинтересовали игры.
          Чуть повзрослев и начав пользоваться всемирной паутиной, мне показалась интересной внутренняя кухня всех этих
          технологий (и игр, и различных сайтов). Но, к сожалению, в тот момент мне чего-то не хватило и эта идея была
          отложена в дальний ящик. Второе, более серьезное и удачное знакомство с IT началось на этапе поступления в
          Университет. Я считаю, что это знакомство все еще продолжается, только уже на более высоком, осмысленном
          уровне.
          <li>
            Третья причина - окружение
          </li>
          Хоть это и не очень задевает тему программирования как процесса, но это является важным фактором при
          работе/учебе. При общении с профессионалами можно добиться лучших успехов в более короткие сроки.

        </ul>
      </div>
    </div>
    <div class="git_block__wrapper wrapper">
      <div class="block__title">
        Ссылка на репозиторий
      </div>
      <div class="block__content">
        <a href="https://github.com/Flm-c/ya.study" target="_blank">https://github.com/Flm-c/ya.study</a>
      </div>
    </div>
    <div class="git_block__wrapper wrapper">
      <div class="block__title">
        Notion второго задания
      </div>
      <div class="block__content">
        <a href="https://quirky-smoke-fc6.notion.site/Yandex-c95008b5b1ce4c22807c05da269e26f1?pvs=4" target="_blank">Notion</a>
      </div>
    </div>
  </div>
</template>

<style scoped>

</style>